## Terraform data for `cluster` stack
#### Terraform Initialization ⚙️ `success`
#### Terraform Validation 🤖 `success`
<details><summary>Show Validation</summary>

```
Success! The configuration is valid.


```
</details>

#### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>

```
module.cert_manager.helm_release.cert_manager: Refreshing state... [id=cert-manager]
module.promtail.kubernetes_service.app[0]: Refreshing state... [id=monitoring/promtail]
module.cert_manager.null_resource.cert_manager_ovh_source: Refreshing state... [id=6901452211892208863]
module.prometheus.kubernetes_persistent_volume_claim.app["data"]: Refreshing state... [id=monitoring/prometheus-data]
module.tempo.kubernetes_service.app[0]: Refreshing state... [id=monitoring/tempo]
module.promtail.kubernetes_config_map.app["config"]: Refreshing state... [id=monitoring/promtail-config]
kubernetes_role.loki: Refreshing state... [id=monitoring/loki]
kubernetes_cluster_role.prometheus: Refreshing state... [id=prometheus]
module.prometheus.kubernetes_config_map.app["config"]: Refreshing state... [id=monitoring/prometheus-config]
module.istio.kubectl_manifest.gateways["dev-s42-previews"]: Refreshing state... [id=/apis/networking.istio.io/v1alpha3/namespaces/previews/gateways/dev-s42-previews]
module.istio.kubectl_manifest.gateways["app-s42"]: Refreshing state... [id=/apis/networking.istio.io/v1alpha3/namespaces/production/gateways/app-s42]
module.istio.kubectl_manifest.gateways["app-s42-dashboards"]: Refreshing state... [id=/apis/networking.istio.io/v1alpha3/namespaces/monitoring/gateways/app-s42-dashboards]
module.istio.kubectl_manifest.gateways["app-s42-next"]: Refreshing state... [id=/apis/networking.istio.io/v1alpha3/namespaces/staging/gateways/app-s42-next]
module.tempo.kubernetes_persistent_volume_claim.app["data"]: Refreshing state... [id=monitoring/tempo-data]
module.loki.kubernetes_service.app[0]: Refreshing state... [id=monitoring/loki]
module.loki.kubernetes_persistent_volume_claim.app["data"]: Refreshing state... [id=monitoring/loki-data]
module.prometheus.kubernetes_service.app[0]: Refreshing state... [id=monitoring/prometheus]
module.promtail.kubernetes_daemonset.app[0]: Refreshing state... [id=monitoring/promtail]
kubernetes_service_account.loki: Refreshing state... [id=monitoring/loki]
kubernetes_service_account.tempo: Refreshing state... [id=monitoring/tempo]
module.loki.kubernetes_config_map.app["config"]: Refreshing state... [id=monitoring/loki-config]
module.grafana.kubernetes_service.app[0]: Refreshing state... [id=monitoring/grafana]
module.tempo.kubernetes_config_map.app["config"]: Refreshing state... [id=monitoring/tempo-config]
kubernetes_cluster_role.promtail: Refreshing state... [id=promtail]
kubernetes_service_account.promtail: Refreshing state... [id=monitoring/promtail]
kubernetes_service_account.prometheus: Refreshing state... [id=monitoring/prometheus]
module.grafana.kubernetes_persistent_volume_claim.app["data"]: Refreshing state... [id=monitoring/grafana-data]
module.monitoring_routing.kubectl_manifest.virtual_services["app-s42-dashboards"]: Refreshing state... [id=/apis/networking.istio.io/v1alpha3/namespaces/monitoring/virtualservices/app-s42-dashboards]
module.grafana.kubernetes_deployment.app[0]: Refreshing state... [id=monitoring/grafana]
kubernetes_role_binding.loki: Refreshing state... [id=monitoring/loki]
module.tempo.kubernetes_stateful_set.app[0]: Refreshing state... [id=monitoring/tempo]
module.prometheus.kubernetes_stateful_set.app[0]: Refreshing state... [id=monitoring/prometheus]
module.loki.kubernetes_stateful_set.app[0]: Refreshing state... [id=monitoring/loki]
kubernetes_cluster_role_binding.promtail: Refreshing state... [id=promtail]
kubernetes_cluster_role_binding.prometheus: Refreshing state... [id=prometheus]
module.cert_manager.kubernetes_role.cert_manager_webhook_ovh_secret_reader: Refreshing state... [id=cert-manager/cert-manager-webhook-ovh:secret-reader]
module.cert_manager.kubectl_manifest.certificates["app-s42"]: Refreshing state... [id=/apis/cert-manager.io/v1/namespaces/istio-system/certificates/app-s42]
module.cert_manager.kubectl_manifest.certificates["dev-s42-previews"]: Refreshing state... [id=/apis/cert-manager.io/v1/namespaces/istio-system/certificates/dev-s42-previews]
module.cert_manager.kubectl_manifest.certificates["app-s42-next"]: Refreshing state... [id=/apis/cert-manager.io/v1/namespaces/istio-system/certificates/app-s42-next]
module.cert_manager.kubectl_manifest.certificates["dev-s42-sandbox"]: Refreshing state... [id=/apis/cert-manager.io/v1/namespaces/istio-system/certificates/dev-s42-sandbox]
module.cert_manager.kubectl_manifest.certificates["app-s42-dashboards"]: Refreshing state... [id=/apis/cert-manager.io/v1/namespaces/istio-system/certificates/app-s42-dashboards]
module.cert_manager.kubernetes_role_binding.cert_manager_webhook_ovh_secret_reader: Refreshing state... [id=cert-manager/cert-manager-webhook-ovh:secret-reader]
module.cert_manager.helm_release.cert_manager_ovh: Refreshing state... [id=cert-manager-webhook-ovh]
module.cert_manager.kubectl_manifest.self_signed_issuers["selfsigned-issuer"]: Refreshing state... [id=/apis/cert-manager.io/v1/clusterissuers/selfsigned-issuer]
module.cert_manager.kubectl_manifest.issuers["ovh-staging-issuer"]: Refreshing state... [id=/apis/cert-manager.io/v1/clusterissuers/ovh-staging-issuer]
module.cert_manager.kubectl_manifest.issuers["ovh-issuer"]: Refreshing state... [id=/apis/cert-manager.io/v1/clusterissuers/ovh-issuer]
module.secrets.kubernetes_manifest.sealed_secret["ovh-credentials"]: Refreshing state...
module.secrets.kubernetes_manifest.sealed_secret["ghcr-creds"]: Refreshing state...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.loki.kubernetes_config_map.app["config"] will be updated in-place
  ~ resource "kubernetes_config_map" "app" {
      ~ data        = {
          ~ "loki.yaml" = <<-EOT
                auth_enabled: false
              - 
                common:
                  ring:
                    instance_addr: 127.0.0.1
                    kvstore:
                      store: inmemory
                  replication_factor: 1
                  path_prefix: /data/loki
                
              - compactor:
              -   working_directory: /tmp/loki/compactor
              -   retention_enabled: true
              -   retention_delete_delay: 336h
              -   retention_delete_worker_count: 150
              -   deletion_mode: filter-and-delete
              -   delete_request_cancel_period: 336h
              - 
              - 
                schema_config:
                  configs:
                    - from: 2020-05-15
                      store: boltdb-shipper
                      object_store: filesystem
                      schema: v11
                      index:
              -         prefix: loki_index_
              +         prefix: loki_
                        period: 24h
                
                storage_config:
                  boltdb_shipper:
                    shared_store: filesystem
                    active_index_directory: /data/loki/boltdb-shipper-active
                    cache_location: /data/loki/boltdb-shipper-cache
                    cache_ttl: 24h
                  filesystem:
                    directory: /data/loki/chunks
              - table_manager:
              -   retention_period: 336h  # Cela correspond à 14 jours
              +   retention:
              +     period: 336h  # Cela correspond à 14 jours
                
                limits_config:
              -   retention_period: 336h  # 14 jours
              +   retention_period: 336h
              +   retention_stream:
              +     - selector: '{namespace="sandbox"}'
              +       priority: 1
              +       period: 24h
              +     - selector: '{namespace="previews"}'
              +       priority: 1
              +       period: 24h
                
                memberlist:
                  join_members:
                    - "loki"
                
                server:
                  grpc_listen_port: 9095
                  http_listen_port: 3100
              + 
            EOT
        }
        id          = "monitoring/loki-config"
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.loki.kubernetes_persistent_volume_claim.app["data"] will be created
  + resource "kubernetes_persistent_volume_claim" "app" {
      + id               = (known after apply)
      + wait_until_bound = true

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app"                          = "loki"
              + "app.kubernetes.io/created-by" = "github-actions"
              + "app.kubernetes.io/managed-by" = "terraform"
              + "app.kubernetes.io/part-of"    = "loki"
              + "app.kubernetes.io/version"    = "2.8.2"
              + "kubernetes.io/name"           = "loki"
              + "version"                      = "2.8.2"
            }
          + name             = "loki-data"
          + namespace        = "monitoring"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + access_modes       = [
              + "ReadWriteMany",
            ]
          + storage_class_name = "csi-cinder-classic"
          + volume_name        = (known after apply)

          + resources {
              + requests = {
                  + "storage" = "25Gi"
                }
            }
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.

Warning: "default_secret_name" is no longer applicable for Kubernetes v1.24.0 and above

  with kubernetes_service_account.prometheus,
  on monitoring.tf line 73, in resource "kubernetes_service_account" "prometheus":
  73: resource "kubernetes_service_account" "prometheus" {

Starting from version 1.24.0 Kubernetes does not automatically generate a
token for service accounts, in this case, "default_secret_name" will be empty

(and 3 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: cluster-tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "cluster-tfplan"

```
</details>